case_template/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// Generated by makeMesh.py — do not edit. Grid level: coarse
// (r = 1.3 per direction from the 2 mm coarse base; §4.8 GCI family).
// Background block = inner cavity of Liu et al.'s acrylic box (D-09 rig),
// 120 x 80 x 100 mm; module placement TODO(validation) pending figures.

scale   0.001;

vertices
(
    (-90 -23   0)
    ( 90 -23   0)
    ( 90  23   0)
    (-90  23   0)
    (-90 -23  72)
    ( 90 -23  72)
    ( 90  23  72)
    (-90  23  72)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (90 23 36) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces ((0 4 7 3));
    }
    outlet
    {
        type patch;
        faces ((1 2 6 5));
    }
    walls               // floor, lid, sides: adiabatic duct (§4.3, D-10)
    {
        type wall;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            (0 1 5 4)
            (3 7 6 2)
        );
    }
);
