case_template/constant/cell3/thermophysicalProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// Generated by makePhysics.py — do not edit; sources: properties.yaml.


thermoType
{
    type            heSolidThermo;
    mixture         pureMixture;
    transport       constAnIso;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

// 18650 jellyroll, anisotropy 29x; local (r, theta, z) via cylindrical CS
// on THIS cell's axis. Interface BCs must use kappaMethod
// directionalSolidThermo + alphaAni aniAlpha (scalar kappa() is mag-collapsed).
coordinateSystem
{
    type    cylindrical;
    origin  (-0.0200 0.0100 -0.001);
    rotation
    {
        type    axes;
        e3      (0 0 1);
        e1      (1 0 0);
    }
}

mixture
{
    specie
    {
        molWeight   100;
    }
    thermodynamics
    {
        Hf          0;
        Sf          0;
        Cp          1145.0;
    }
    transport
    {
        kappa       (1.2 1.2 34.4);
    }
    equationOfState
    {
        rho         2523.0;
    }
}
