case_template/constant/cell4/fvOptions
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// Generated by makePhysics.py — do not edit; sources: properties.yaml.


// source-model: liu3c  (marker read by extract_metrics.py)
cellHeat
{
    type            scalarSemiImplicitSource;
    selectionMode   all;
    volumeMode      specific;       // W/m3
    // Liu et al. 3C heat-generation polynomial (heatgen.yaml, Eq. 5 of the
    // AM), divided by the cell volume 1.679495e-05 m3. Valid for
    // t in [0, 900.0] s — the fit DIVERGES past the end
    // of discharge, so endTime must not exceed t_discharge.
    sources
    {
        h
        {
            explicit    polynomial ((103007.13 0) (263.17428 1) (-0.92289623 2) (0.0016969382 3) (-1.7922049e-06 4) (8.0381284e-10 5));
            implicit    none;
        }
    }
}
