case_template/constant/cell5/radiationProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      radiationProperties;
}
radiation       off;
radiationModel  none;
