case_template/constant/fluid/thermophysicalProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// Generated by makePhysics.py — do not edit; sources: properties.yaml.


thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       polynomial;
    thermo          hPolynomial;
    equationOfState icoPolynomial;
    specie          specie;
    energy          sensibleEnthalpy;
}

// Novec-7200 (HFE-7200). Constant-property polynomials anchored at 25 C
// except rho(T): linear with PLACEHOLDER beta = 0.0016 1/K (buoyancy driver).
// k = 0.068 W/m.K is the D-07 baseline (0.6 = sensitivity case).
mixture
{
    specie
    {
        molWeight   264;        // C4F9OC2H5
    }
    thermodynamics
    {
        Hf          0;
        Sf          0;
        CpCoeffs<8> (1220.0 0 0 0 0 0 0 0);
    }
    transport
    {
        muCoeffs<8>     (0.00061 0 0 0 0 0 0 0);
        kappaCoeffs<8>  (0.068 0 0 0 0 0 0 0);
    }
    equationOfState
    {
        rhoCoeffs<8>    (2112.17 -2.288 0 0 0 0 0 0);
    }
}
