case_template/0.orig/rho
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      rho;
}
dimensions      [1 -3 0 0 0 0 0];
internalField   uniform 1430;
boundaryField
{
    ".*" { type calculated; value uniform 1430; }
}
