case_template/system/fluid/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// §4.6: second-order limitedLinear for U and h (no upwind in final runs —
// numerical diffusion in the wakes is where the mechanism lives). Euler ddt
// for start-up robustness; production switches to backward.

ddtSchemes
{
    default         backward;   // §4.6 production (Euler = DDT=Euler override, start-up only)
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss limitedLinear 1;
    div(phi,h)      Gauss limitedLinear 1;
    div(phi,K)      Gauss limitedLinear 1;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited corrected 0.5;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited corrected 0.5;
}

// ************************************************************************* //
