case_template/system/cell1/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// Generated by makePhysics.py — do not edit; sources: properties.yaml.


// Solid energy matrix is symmetric despite anisotropic kappa -> PCG/DIC
// (DILU aborts; known trap).
solvers
{
    h
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          0.1;
    }
    hFinal
    {
        $h;
        relTol          0;
    }
}

PIMPLE
{
    nNonOrthogonalCorrectors 0;
}
