case_template/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// Global outer-loop controls; per-region solvers live in system/<region>/.

PIMPLE
{
    nOuterCorrectors    2;      // §4.6
}
