case_template/system/cell1/changeDictionaryDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// Generated by makePhysics.py — do not edit; sources: properties.yaml.


T
{
    boundaryField
    {
        // trap: among regex entries the LAST match wins — catch-all first
        ".*"
        {
            type            zeroGradient;
            value           uniform 295.15;
        }
        // bottom cap on the duct floor: adiabatic (D-10 — duct walls
        // adiabatic per §4.3; no bath behind the production duct)
        walls
        {
            type            zeroGradient;
        }
        "cell1_to_.*"
        {
            type            compressible::turbulentTemperatureCoupledBaffleMixed;
            Tnbr            T;
            kappaMethod     directionalSolidThermo;
            alphaAni        aniAlpha;
            value           uniform 295.15;
        }
    }
}
