case_template/system/fluid/changeDictionaryDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// Generated by makePhysics.py — do not edit; sources: properties.yaml.


// trap: among regex boundaryField entries the LAST match wins — ".*" first.
U
{
    boundaryField
    {
        ".*"    { type noSlip; }
        inlet
        {
            type            flowRateInletVelocity;
            volumetricFlowRate
            {
                type    scale;
                scale   { type linearRamp; start 0; duration 2.0; }
                value   {
                    type        sine;
                    frequency   1.0;
                    amplitude   1;
                    scale       6e-07;   // A * Qbar
                    level       1.5e-06;         // Qbar
                    t0          0;
                }
            }
            value           uniform (0 0 0);
        }
        outlet
        {
            type            pressureInletOutletVelocity;
            value           uniform (0 0 0);
        }
    }
}

T
{
    boundaryField
    {
        ".*"    { type zeroGradient; }     // duct walls adiabatic (D-10)
        inlet   { type fixedValue; value uniform 298.15; }
        outlet  { type inletOutlet; inletValue uniform 298.15; value uniform 298.15; }
        "fluid_to_.*"
        {
            type            compressible::turbulentTemperatureCoupledBaffleMixed;
            Tnbr            T;
            kappaMethod     fluidThermo;
            value           uniform 298.15;
        }
    }
}

p_rgh
{
    boundaryField
    {
        ".*"    { type fixedFluxPressure; value uniform 101325; }
        outlet  { type fixedValue; value uniform 101325; }
    }
}

p
{
    boundaryField
    {
        ".*"    { type calculated; value uniform 101325; }
    }
}
