case_template/system/monitors
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      monitors;
}
// Generated by makePhysics.py — do not edit; sources: properties.yaml.


Tmax_cell0
{
    type            volFieldValue;
    libs            (fieldFunctionObjects);
    region          cell0;
    operation       max;
    fields          (T);
    regionType      all;
    writeFields     false;
    writeControl    timeStep;
    writeInterval   10;
}

Tmin_cell0
{
    type            volFieldValue;
    libs            (fieldFunctionObjects);
    region          cell0;
    operation       min;
    fields          (T);
    regionType      all;
    writeFields     false;
    writeControl    timeStep;
    writeInterval   10;
}

TvolAverage_cell0
{
    type            volFieldValue;
    libs            (fieldFunctionObjects);
    region          cell0;
    operation       volAverage;
    fields          (T);
    regionType      all;
    writeFields     false;
    writeControl    timeStep;
    writeInterval   10;
}

Tmax_cell1
{
    type            volFieldValue;
    libs            (fieldFunctionObjects);
    region          cell1;
    operation       max;
    fields          (T);
    regionType      all;
    writeFields     false;
    writeControl    timeStep;
    writeInterval   10;
}

Tmin_cell1
{
    type            volFieldValue;
    libs            (fieldFunctionObjects);
    region          cell1;
    operation       min;
    fields          (T);
    regionType      all;
    writeFields     false;
    writeControl    timeStep;
    writeInterval   10;
}

TvolAverage_cell1
{
    type            volFieldValue;
    libs            (fieldFunctionObjects);
    region          cell1;
    operation       volAverage;
    fields          (T);
    regionType      all;
    writeFields     false;
    writeControl    timeStep;
    writeInterval   10;
}

Tmax_cell2
{
    type            volFieldValue;
    libs            (fieldFunctionObjects);
    region          cell2;
    operation       max;
    fields          (T);
    regionType      all;
    writeFields     false;
    writeControl    timeStep;
    writeInterval   10;
}

Tmin_cell2
{
    type            volFieldValue;
    libs            (fieldFunctionObjects);
    region          cell2;
    operation       min;
    fields          (T);
    regionType      all;
    writeFields     false;
    writeControl    timeStep;
    writeInterval   10;
}

TvolAverage_cell2
{
    type            volFieldValue;
    libs            (fieldFunctionObjects);
    region          cell2;
    operation       volAverage;
    fields          (T);
    regionType      all;
    writeFields     false;
    writeControl    timeStep;
    writeInterval   10;
}

Tmax_cell3
{
    type            volFieldValue;
    libs            (fieldFunctionObjects);
    region          cell3;
    operation       max;
    fields          (T);
    regionType      all;
    writeFields     false;
    writeControl    timeStep;
    writeInterval   10;
}

Tmin_cell3
{
    type            volFieldValue;
    libs            (fieldFunctionObjects);
    region          cell3;
    operation       min;
    fields          (T);
    regionType      all;
    writeFields     false;
    writeControl    timeStep;
    writeInterval   10;
}

TvolAverage_cell3
{
    type            volFieldValue;
    libs            (fieldFunctionObjects);
    region          cell3;
    operation       volAverage;
    fields          (T);
    regionType      all;
    writeFields     false;
    writeControl    timeStep;
    writeInterval   10;
}

Tmax_cell4
{
    type            volFieldValue;
    libs            (fieldFunctionObjects);
    region          cell4;
    operation       max;
    fields          (T);
    regionType      all;
    writeFields     false;
    writeControl    timeStep;
    writeInterval   10;
}

Tmin_cell4
{
    type            volFieldValue;
    libs            (fieldFunctionObjects);
    region          cell4;
    operation       min;
    fields          (T);
    regionType      all;
    writeFields     false;
    writeControl    timeStep;
    writeInterval   10;
}

TvolAverage_cell4
{
    type            volFieldValue;
    libs            (fieldFunctionObjects);
    region          cell4;
    operation       volAverage;
    fields          (T);
    regionType      all;
    writeFields     false;
    writeControl    timeStep;
    writeInterval   10;
}

Tmax_cell5
{
    type            volFieldValue;
    libs            (fieldFunctionObjects);
    region          cell5;
    operation       max;
    fields          (T);
    regionType      all;
    writeFields     false;
    writeControl    timeStep;
    writeInterval   10;
}

Tmin_cell5
{
    type            volFieldValue;
    libs            (fieldFunctionObjects);
    region          cell5;
    operation       min;
    fields          (T);
    regionType      all;
    writeFields     false;
    writeControl    timeStep;
    writeInterval   10;
}

TvolAverage_cell5
{
    type            volFieldValue;
    libs            (fieldFunctionObjects);
    region          cell5;
    operation       volAverage;
    fields          (T);
    regionType      all;
    writeFields     false;
    writeControl    timeStep;
    writeInterval   10;
}

TfluidMinMax
{
    type            fieldMinMax;
    libs            (fieldFunctionObjects);
    region          fluid;
    fields          (T U);
    writeControl    timeStep;
    writeInterval   10;
}

// Liu Fig 9 validation metric: T2 = mid-height SURFACE temperature of a
// middle cell (their thermocouple). Four azimuthal near-surface points in
// cell1 (centre 0,-0.010), r = 8.8 mm, z = 32.5 mm; average in post.
T2probe
{
    type            probes;
    libs            (sampling);
    region          cell1;
    fields          (T);
    probeLocations
    (
        ( 0.0088 -0.0100 0.0325)
        (-0.0088 -0.0100 0.0325)
        ( 0.0000 -0.0012 0.0325)
        ( 0.0000 -0.0188 0.0325)
    );
    writeControl    timeStep;
    writeInterval   10;
}

// live solver-native rho*h storage series: E1's early-window conservation
// gate needs fine cadence (boundary export starts within seconds in a
// tight duct; 30 s saved-field replays are too coarse)
rhoh_fluid
{
    type            volFieldValue;
    libs            (fieldFunctionObjects);
    region          fluid;
    regionType      all;
    operation       weightedVolIntegrate;
    weightField     rho;
    fields          (h);
    writeFields     false;
    writeControl    timeStep;
    writeInterval   10;
}

rhoh_cell0
{
    type            volFieldValue;
    libs            (fieldFunctionObjects);
    region          cell0;
    regionType      all;
    operation       volIntegrate;
    fields          (h);
    writeFields     false;
    writeControl    timeStep;
    writeInterval   10;
}

rhoh_cell1
{
    type            volFieldValue;
    libs            (fieldFunctionObjects);
    region          cell1;
    regionType      all;
    operation       volIntegrate;
    fields          (h);
    writeFields     false;
    writeControl    timeStep;
    writeInterval   10;
}

rhoh_cell2
{
    type            volFieldValue;
    libs            (fieldFunctionObjects);
    region          cell2;
    regionType      all;
    operation       volIntegrate;
    fields          (h);
    writeFields     false;
    writeControl    timeStep;
    writeInterval   10;
}

rhoh_cell3
{
    type            volFieldValue;
    libs            (fieldFunctionObjects);
    region          cell3;
    regionType      all;
    operation       volIntegrate;
    fields          (h);
    writeFields     false;
    writeControl    timeStep;
    writeInterval   10;
}

rhoh_cell4
{
    type            volFieldValue;
    libs            (fieldFunctionObjects);
    region          cell4;
    regionType      all;
    operation       volIntegrate;
    fields          (h);
    writeFields     false;
    writeControl    timeStep;
    writeInterval   10;
}

rhoh_cell5
{
    type            volFieldValue;
    libs            (fieldFunctionObjects);
    region          cell5;
    regionType      all;
    operation       volIntegrate;
    fields          (h);
    writeFields     false;
    writeControl    timeStep;
    writeInterval   10;
}

// stored-energy bookkeeping for the §9 energy balance (extract_metrics.py)
TvolAverage_fluid
{
    type            volFieldValue;
    libs            (fieldFunctionObjects);
    region          fluid;
    operation       volAverage;
    fields          (T);
    regionType      all;
    writeFields     false;
    writeControl    timeStep;
    writeInterval   10;
}

// wall loss on the FLUID side only — solid-side wallHeatFlux is mag(kappa)-
// collapsed and must never be used (docs/environment.md trap).
// Two-stage chain: the FO computes the field EVERY step (cheap, in memory)
// but only writes the volume field at writeTime (trap); the
// surfaceFieldValue below samples the registered field every 10 steps so
// the §9 wall-loss integral resolves the early t^-1/2 transient.
wallLoss_fluid
{
    type            wallHeatFlux;
    libs            (fieldFunctionObjects);
    region          fluid;
    patches         (walls);
    executeControl  timeStep;
    executeInterval 1;
    writeControl    writeTime;   // volume-field trap: tie to writeTime
}

wallLossInt_fluid
{
    type            surfaceFieldValue;
    libs            (fieldFunctionObjects);
    region          fluid;
    regionType      patch;
    name            walls;
    operation       areaIntegrate;
    fields          (wallHeatFlux);
    writeFields     false;
    writeControl    timeStep;
    writeInterval   10;
}

sum_inlet
{
    type            surfaceFieldValue;
    libs            (fieldFunctionObjects);
    region          fluid;
    regionType      patch;
    name            inlet;
    operation       sum;
    fields          (phi);
    writeFields     false;
    writeControl    timeStep;
    writeInterval   5;
}

areaAverage_inlet
{
    type            surfaceFieldValue;
    libs            (fieldFunctionObjects);
    region          fluid;
    regionType      patch;
    name            inlet;
    operation       areaAverage;
    fields          (p T);
    writeFields     false;
    writeControl    timeStep;
    writeInterval   5;
}

TphiSum_inlet
{
    type            surfaceFieldValue;
    libs            (fieldFunctionObjects);
    region          fluid;
    regionType      patch;
    name            inlet;
    operation       weightedSum;
    weightField     phi;
    fields          (T);
    writeFields     false;
    writeControl    timeStep;
    writeInterval   5;
}

sum_outlet
{
    type            surfaceFieldValue;
    libs            (fieldFunctionObjects);
    region          fluid;
    regionType      patch;
    name            outlet;
    operation       sum;
    fields          (phi);
    writeFields     false;
    writeControl    timeStep;
    writeInterval   5;
}

areaAverage_outlet
{
    type            surfaceFieldValue;
    libs            (fieldFunctionObjects);
    region          fluid;
    regionType      patch;
    name            outlet;
    operation       areaAverage;
    fields          (p T);
    writeFields     false;
    writeControl    timeStep;
    writeInterval   5;
}

TphiSum_outlet
{
    type            surfaceFieldValue;
    libs            (fieldFunctionObjects);
    region          fluid;
    regionType      patch;
    name            outlet;
    operation       weightedSum;
    weightField     phi;
    fields          (T);
    writeFields     false;
    writeControl    timeStep;
    writeInterval   5;
}
